; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-8)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 )
(:init
(on b1 b8)
(on b2 b6)
(ontable b3)
(ontable b4)
(on b5 b4)
(on b6 b3)
(on b7 b2)
(on b8 b7)
(clear b1)
(clear b5)
)
(:goal
(and
(on b1 b6)
(on b2 b7)
(on b4 b8)
(on b6 b2)
(on b7 b3))
)
)

; plan
1. (move-b-to-t b1 b8)
   deleted: (on b1 b8)
   added: (ontable b1) (clear b8)
   goals met: 0 of 5
2. (move-b-to-t b8 b7)
   deleted: (on b8 b7)
   added: (ontable b8) (clear b7)
   goals met: 0 of 5
3. (move-b-to-b b5 b4 b5)
   deleted: (clear b5) (on b5 b4)
   added: (on b5 b5) (clear b4)
   goals met: 0 of 5
4. (move-t-to-b b4 b8)
   deleted: (clear b8) (ontable b4)
   added: (on b4 b8)
   goals met: 1 of 5
5. (move-b-to-b b7 b2 b4)
   deleted: (clear b4) (on b7 b2)
   added: (on b7 b4) (clear b2)
   goals met: 1 of 5
6. (move-b-to-b b2 b6 b1)
   deleted: (clear b1) (on b2 b6)
   added: (on b2 b1) (clear b6)
   goals met: 1 of 5
7. (move-b-to-t b6 b3)
   deleted: (on b6 b3)
   added: (ontable b6) (clear b3)
   goals met: 1 of 5
8. (move-b-to-b b7 b4 b3)
   deleted: (clear b3) (on b7 b4)
   added: (on b7 b3) (clear b4)
   goals met: 2 of 5
9. (move-b-to-b b2 b1 b7)
   deleted: (clear b7) (on b2 b1)
   added: (on b2 b7) (clear b1)
   goals met: 3 of 5
10. (move-t-to-b b6 b2)
   deleted: (clear b2) (ontable b6)
   added: (on b6 b2)
   goals met: 4 of 5
11. (move-t-to-b b1 b6)
   deleted: (clear b6) (ontable b1)
   added: (on b1 b6)
   goals met: 5 of 5
